tests/stress/load-test.yml
config:
  target: "https://foro-backend-9j93.onrender.com"
  phases:
    # Fase 1: Calentamiento - 10 usuarios durante 30 segundos
    - duration: 30
      arrivalRate: 10
      name: "Warm up"
    
    # Fase 2: Carga normal - 50 usuarios durante 2 minutos
    - duration: 120
      arrivalRate: 50
      name: "Normal load"
    
    # Fase 3: Pico de carga - 100 usuarios durante 1 minuto
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    
    # Fase 4: Estrés extremo - 200 usuarios durante 30 segundos
    - duration: 30
      arrivalRate: 200
      name: "Stress test"
    
    # Fase 5: Recuperación - 20 usuarios durante 30 segundos
    - duration: 30
      arrivalRate: 20
      name: "Recovery"

  defaults:
    headers:
      Content-Type: "application/json"

  processor: "./stress-helpers.js"

scenarios:
  # Escenario 1: Registro de usuarios
  - name: "User Registration"
    weight: 20
    flow:
      - post:
          url: "/api/users/register"
          json:
            username: "testuser_{{ $randomString() }}"
            email: "test_{{ $randomString() }}@example.com"
            password: "Password123!"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 201

  # Escenario 2: Login de usuarios
  - name: "User Login"
    weight: 30
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Password123!"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200

  # Escenario 3: Obtener posts
  - name: "Get Posts"
    weight: 25
    flow:
      - get:
          url: "/api/posts?page=1&limit=20"
          expect:
            - statusCode: 200
            - contentType: json

  # Escenario 4: Crear post (requiere autenticación)
  - name: "Create Post"
    weight: 15
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Password123!"
          capture:
            - json: "$.token"
              as: "authToken"
      - post:
          url: "/api/posts"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "Test Post {{ $randomString() }}"
            content: "This is a test post content"
            categoryId: "{{ categoryId }}"
          expect:
            - statusCode: 201

  # Escenario 5: Obtener perfil de usuario
  - name: "Get User Profile"
    weight: 10
    flow:
      - get:
          url: "/api/users/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Escenario 6: Sistema de mensajería
  - name: "Messaging System"
    weight: 10
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Password123!"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/messages"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Escenario 7: Sistema de referidos
  - name: "Referral System"
    weight: 5
    flow:
      - post:
          url: "/api/users/login"
          json:
            username: "testuser"
            password: "Password123!"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/referrals/stats"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Escenario 8: Búsqueda de usuarios
  - name: "Search Users"
    weight: 10
    flow:
      - get:
          url: "/api/users/search?q=test"
          expect:
            - statusCode: 200

  # Escenario 9: Obtener categorías
  - name: "Get Categories"
    weight: 15
    flow:
      - get:
          url: "/api/categories"
          expect:
            - statusCode: 200

  # Escenario 10: WebSocket connections (simulación)
  - name: "WebSocket Simulation"
    weight: 5
    flow:
      - get:
          url: "/api/posts?page=1&limit=5"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/posts?page=1&limit=5"
          expect:
            - statusCode: 200